# Киты динамики:
# 1)Параметры    префиксы
# 2)База динамики   d[0][0]
# 3)Формула/Алгоритм пересчёта   d[i][j]=max(d[i-1][j],d[i-1][j])+1
# 4)Порядок пересчёта      сверху вниз, слева направо / диагоналями
# 5)Где ответ?     ответ по префиксу

# динамика назад
fib = [0] * (n + 1)
fib[1] = 1
for i in range(2, n + 1):
    fib[i] = fib[i - 2] + fib[i - 1]
print(fib[n])

# динамика вперёд
fib = [0] * (n + 2)
fib[1] = 1
for i in range(2, n):
    fib[i + 1] += fib[i]
    fib[i + 2] += fib[i]
print(fib[n])
